Hong-yiii/location_intelligence_embedded/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_HeliosIRQPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_HeliosIRQPins(void)
{
    /* Enables the clock for the Input Mux. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* PIO0_15 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort0Pin15ToPintsel);

    IOCON->PIO[0][15] = ((IOCON->PIO[0][15] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_OD_MASK))) // added OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT015 (pin 18) is configured as PIO0_15. */
                         | IOCON_PIO_FUNC(PIO0_15_FUNC_ALT0)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_15_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: USART0, signal: TXD, pin_signal: PIO0_8/SPI0_MOSI/USART0_TXD/CT32B0_MAT0/PWM8/ANA_COMP_OUT/RFTX/PDM1_DATA}
  - {pin_num: '12', peripheral: USART0, signal: RXD, pin_signal: PIO0_9/SPI0_SSELN/USART0_RXD/CT32B1_CAP1/PWM9/USART1_SCK/ADO/PDM1_CLK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_UARTPins(void)
{
    PRINTF("RV4_Init_UARTPins: Starting...\r\n");
    
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    PRINTF("RV4_Init_UARTPins: Enabling IOCON clock...\r\n");
    CLOCK_EnableClock(kCLOCK_Iocon);

    PRINTF("RV4_Init_UARTPins: Configuring TX pin (PIO0_8)...\r\n");
    IOCON->PIO[0][8] = ((IOCON->PIO[0][8] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT08 (pin 11) is configured as USART0_TXD. */
                        | IOCON_PIO_FUNC(PIO0_8_FUNC_ALT2)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_8_DIGIMODE_DIGITAL));
    PRINTF("RV4_Init_UARTPins: TX pin configured (PIO0_8 = 0x%08X)\r\n", IOCON->PIO[0][8]);

    PRINTF("RV4_Init_UARTPins: Configuring RX pin (PIO0_9)...\r\n");
    IOCON->PIO[0][9] = ((IOCON->PIO[0][9] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK))) // added MODE mask

                        /* Select digital function assigned to this pin.
                         * : PORT09 (pin 12) is configured as USART0_RXD. */
                        | IOCON_PIO_FUNC(PIO0_9_FUNC_ALT2)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_9_DIGIMODE_DIGITAL));
    PRINTF("RV4_Init_UARTPins: RX pin configured (PIO0_9 = 0x%08X)\r\n", IOCON->PIO[0][9]);
    
    PRINTF("RV4_Init_UARTPins: UART pin initialization complete\r\n");
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_I2CPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: I2C0, signal: SCL, pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA}
  - {pin_num: '14', peripheral: I2C0, signal: SDA, pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_I2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_I2CPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][10] = ((IOCON->PIO[0][10] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                 IOCON_PIO_OD_MASK))) // added MODE, OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT010 (pin 13) is configured as I2C0_SCL. */
                         | IOCON_PIO_FUNC(PIO0_10_FUNC_ALT5) |
                         IOCON_PIO_EGP(0) // added EGP.
                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_10_DIGIMODE_DIGITAL));

    IOCON->PIO[0][11] = ((IOCON->PIO[0][11] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                 IOCON_PIO_OD_MASK))) // added MODE, OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT011 (pin 14) is configured as I2C0_SDA. */
                         | IOCON_PIO_FUNC(PIO0_11_FUNC_ALT5) |
                         IOCON_PIO_EGP(0) // added EGP.
                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_11_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_SWDPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '15', peripheral: SWD, signal: SWCLK, pin_signal: PIO0_12/IR_BLASTER/SWCLK/PWM0/I2C1_SCL/SPI0_MOSI/ANA_COMP_OUT}
  - {pin_num: '16', peripheral: SWD, signal: SWDIO, pin_signal: PIO0_13/SPI1_SSELN2/SWDIO/PWM2/I2C1_SDA/SPI0_SSELN}
  - {pin_num: '17', peripheral: SWD, signal: SWO, pin_signal: PIO0_14/SPI1_SSELN1/USART0_SCK/CT32B0_CAP1/PWM1/SWO/MCLK/RFTX/ADC0_0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

