Hong-yiii/location_intelligence_embedded/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_ISPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_ISPPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_HeliosCEPin:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '21', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/SPI1_MOSI/ISO7816_CLK/SWO/PWM6/CLK_OUT/SPIFI_IO3/ADC0_3, identifier: HELIOS_CE, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_HeliosCEPin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_HeliosCEPin(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t HELIOS_CE_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_17 (pin 21)  */
    GPIO_PinInit(RV4_INIT_HELIOSCEPIN_HELIOS_CE_GPIO,
        RV4_INIT_HELIOSCEPIN_HELIOS_CE_PORT,
        RV4_INIT_HELIOSCEPIN_HELIOS_CE_PIN,
        &HELIOS_CE_config);

    IOCON->PIO[0][17] = ((IOCON->PIO[0][17] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT017 (pin 21) is configured as PIO0_17. */
                         | IOCON_PIO_FUNC(PIO0_17_FUNC_ALT0)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_17_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_HW_FlowPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '9', peripheral: USART0, signal: RTS, pin_signal: PIO0_6/SPI0_SCK/USART0_RTS/CT32B1_MAT0/PWM6/I2C1_SCL/USART1_TXD/ADE, identifier: ''}
  - {pin_num: '10', peripheral: USART0, signal: CTS, pin_signal: PIO0_7/SPI0_MISO/USART0_CTS/CT32B1_MAT1/PWM7/I2C1_SDA/USART1_RXD/ADO}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_HW_FlowPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
#if HW_FLOW_CONTROL_SUPPORT
void RV4_Init_HW_FlowPins(void)
{
    PRINTF("RV4_Init_HW_FlowPins: Starting...\r\n");
    
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    PRINTF("RV4_Init_HW_FlowPins: Enabling IOCON clock...\r\n");
    CLOCK_EnableClock(kCLOCK_Iocon);

    PRINTF("RV4_Init_HW_FlowPins: Configuring RTS pin (PIO0_6)...\r\n");
    IOCON->PIO[0][6] = ((IOCON->PIO[0][6] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT06 (pin 9) is configured as USART0_RTS. */
                        | IOCON_PIO_FUNC(PIO0_6_FUNC_ALT2)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_6_DIGIMODE_DIGITAL));
    PRINTF("RV4_Init_HW_FlowPins: RTS pin configured (PIO0_6 = 0x%08X)\r\n", IOCON->PIO[0][6]);

    PRINTF("RV4_Init_HW_FlowPins: Configuring CTS pin (PIO0_7)...\r\n");
    IOCON->PIO[0][7] = ((IOCON->PIO[0][7] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT07 (pin 10) is configured as USART0_CTS. */
                        | IOCON_PIO_FUNC(PIO0_7_FUNC_ALT2)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_7_DIGIMODE_DIGITAL));
    PRINTF("RV4_Init_HW_FlowPins: CTS pin configured (PIO0_7 = 0x%08X)\r\n", IOCON->PIO[0][7]);
    
    PRINTF("RV4_Init_HW_FlowPins: Hardware flow control initialization complete\r\n");
}
#endif

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_VenusPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '10', peripheral: GPIO, signal: 'PIO0, 7', pin_signal: PIO0_7/SPI0_MISO/USART0_CTS/CT32B1_MAT1/PWM7/I2C1_SDA/USART1_RXD/ADO, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_VenusPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_VenusPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

